req_samples/Z_ARIBA_BAPI_PO_CHANGE.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:schemas-iwaysoftware-com:iwse" xmlns:urn1="urn:iwaysoftware:ibse:jul2003:Z_ARIBA_BAPI_PO_CHANGE">
   <soapenv:Header>
      <urn:ibsinfo>
         <urn:service>?</urn:service>
         <urn:method>?</urn:method>
         <urn:license>?</urn:license>
         <!--Optional:-->
         <urn:disposition>?</urn:disposition>
         <!--Optional:-->
         <urn:Username>?</urn:Username>
         <!--Optional:-->
         <urn:Password>?</urn:Password>
         <!--Optional:-->
         <urn:language>?</urn:language>
      </urn:ibsinfo>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:Z_ARIBA_BAPI_PO_CHANGE>
         <urn1:Z_ARIBA_BAPI_PO_CHANGE>
            <!--You may enter the following 12 items in any order-->
            <!--Optional:-->
            <urn1:PARTITION>?</urn1:PARTITION>
            <urn1:PO_HEADER>
               <urn1:EBELN>?</urn1:EBELN>
               <urn1:ERPORDERID>?</urn1:ERPORDERID>
               <urn1:VERSION>?</urn1:VERSION>
               <urn1:LIFNR>?</urn1:LIFNR>
               <urn1:ORDERTYPE>?</urn1:ORDERTYPE>
               <urn1:EKGRP>?</urn1:EKGRP>
               <urn1:EKORG>?</urn1:EKORG>
               <urn1:AEDAT>?</urn1:AEDAT>
               <urn1:UNSEZ>?</urn1:UNSEZ>
               <urn1:WAERS>?</urn1:WAERS>
               <urn1:CHGSTATE>?</urn1:CHGSTATE>
               <!--Optional:-->
               <urn1:PMNTTRMS>?</urn1:PMNTTRMS>
            </urn1:PO_HEADER>
            <!--Optional:-->
            <urn1:VARIANT>?</urn1:VARIANT>
            <!--Optional:-->
            <urn1:DELPO_ACCNTS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:SERIAL_NO>?</urn1:SERIAL_NO>
               </urn1:item>
            </urn1:DELPO_ACCNTS>
            <!--Optional:-->
            <urn1:DELPO_ITEMS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
               </urn1:item>
            </urn1:DELPO_ITEMS>
            <!--Optional:-->
            <urn1:ERROR_MSG_TABLE>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELN>?</urn1:EBELN>
                  <urn1:ERPORDERID>?</urn1:ERPORDERID>
                  <urn1:NUMINSET>?</urn1:NUMINSET>
                  <urn1:TYPE>?</urn1:TYPE>
                  <urn1:MSGID>?</urn1:MSGID>
                  <urn1:MSGNR>?</urn1:MSGNR>
                  <urn1:DYNAME>?</urn1:DYNAME>
                  <urn1:DYNUMB>?</urn1:DYNUMB>
                  <urn1:FLDNAME>?</urn1:FLDNAME>
                  <urn1:MESSAGE>?</urn1:MESSAGE>
                  <urn1:DATETIME2>?</urn1:DATETIME2>
                  <urn1:SYSID>?</urn1:SYSID>
                  <urn1:MANDT>?</urn1:MANDT>
               </urn1:item>
            </urn1:ERROR_MSG_TABLE>
            <!--Optional:-->
            <urn1:PO_ACCOUNTS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:SERIAL_NO>?</urn1:SERIAL_NO>
                  <urn1:MKNTM>?</urn1:MKNTM>
                  <urn1:SAKTO>?</urn1:SAKTO>
                  <urn1:KOSTL>?</urn1:KOSTL>
                  <urn1:AUFNR>?</urn1:AUFNR>
                  <urn1:ANLN1>?</urn1:ANLN1>
                  <urn1:ANLN2>?</urn1:ANLN2>
                  <urn1:PS_PSP_PNR>?</urn1:PS_PSP_PNR>
                  <urn1:MKNTMLIMIT>?</urn1:MKNTMLIMIT>
                  <urn1:CHGSTATE>?</urn1:CHGSTATE>
               </urn1:item>
            </urn1:PO_ACCOUNTS>
            <!--Optional:-->
            <urn1:PO_COND>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:KSCHL>?</urn1:KSCHL>
                  <urn1:KBETR>?</urn1:KBETR>
                  <urn1:KONWA>?</urn1:KONWA>
               </urn1:item>
            </urn1:PO_COND>
            <!--Optional:-->
            <urn1:PO_ITEMS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:TXZ01>?</urn1:TXZ01>
                  <urn1:MATKL>?</urn1:MATKL>
                  <urn1:KNTTP>?</urn1:KNTTP>
                  <urn1:WERKS>?</urn1:WERKS>
                  <urn1:NETPR>?</urn1:NETPR>
                  <urn1:PEINH>?</urn1:PEINH>
                  <urn1:MENGE>?</urn1:MENGE>
                  <urn1:MEINS>?</urn1:MEINS>
                  <urn1:EEIND>?</urn1:EEIND>
                  <urn1:EMATNR>?</urn1:EMATNR>
                  <urn1:SAKTO>?</urn1:SAKTO>
                  <urn1:KOSTL>?</urn1:KOSTL>
                  <urn1:AUFNR>?</urn1:AUFNR>
                  <urn1:PS_PSP_PNR>?</urn1:PS_PSP_PNR>
                  <urn1:ANLN1>?</urn1:ANLN1>
                  <urn1:ANLN2>?</urn1:ANLN2>
                  <urn1:MWSKZ>?</urn1:MWSKZ>
                  <urn1:EPSTP>?</urn1:EPSTP>
                  <urn1:SUMLIMIT>?</urn1:SUMLIMIT>
                  <urn1:COMMITMENT>?</urn1:COMMITMENT>
                  <urn1:REQ_ID>?</urn1:REQ_ID>
                  <urn1:ITEMONREQ>?</urn1:ITEMONREQ>
                  <urn1:VRTKZ>?</urn1:VRTKZ>
                  <urn1:TWRKZ>?</urn1:TWRKZ>
                  <urn1:UNTTO>?</urn1:UNTTO>
                  <urn1:UEBTO>?</urn1:UEBTO>
                  <urn1:CHGSTATE>?</urn1:CHGSTATE>
                  <urn1:LGORT>?</urn1:LGORT>
               </urn1:item>
            </urn1:PO_ITEMS>
            <!--Optional:-->
            <urn1:PO_TEXT>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:TDOBJECT>?</urn1:TDOBJECT>
                  <urn1:TDID>?</urn1:TDID>
                  <urn1:STRINGNUM>?</urn1:STRINGNUM>
                  <urn1:STRING>?</urn1:STRING>
               </urn1:item>
            </urn1:PO_TEXT>
            <!--Optional:-->
            <urn1:PUR_ORDER_DELIVERY>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELN>?</urn1:EBELN>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:EINDT>?</urn1:EINDT>
               </urn1:item>
            </urn1:PUR_ORDER_DELIVERY>
            <!--Optional:-->
            <urn1:PUR_ORDER_DETAILS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELN>?</urn1:EBELN>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:AEDAT>?</urn1:AEDAT>
                  <urn1:MENGE>?</urn1:MENGE>
                  <urn1:MEINS>?</urn1:MEINS>
                  <urn1:NETPR>?</urn1:NETPR>
                  <urn1:REQ_ID>?</urn1:REQ_ID>
                  <urn1:ITEMONREQ>?</urn1:ITEMONREQ>
               </urn1:item>
            </urn1:PUR_ORDER_DETAILS>
         </urn1:Z_ARIBA_BAPI_PO_CHANGE>
      </urn1:Z_ARIBA_BAPI_PO_CHANGE>
   </soapenv:Body>
</soapenv:Envelope>a<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:schemas-iwaysoftware-com:iwse" xmlns:urn1="urn:iwaysoftware:ibse:jul2003:Z_ARIBA_BAPI_PO_CHANGE">
   <soapenv:Header>
      <urn:ibsinfo>
         <urn:service>?</urn:service>
         <urn:method>?</urn:method>
         <urn:license>?</urn:license>
         <!--Optional:-->
         <urn:disposition>?</urn:disposition>
         <!--Optional:-->
         <urn:Username>?</urn:Username>
         <!--Optional:-->
         <urn:Password>?</urn:Password>
         <!--Optional:-->
         <urn:language>?</urn:language>
      </urn:ibsinfo>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:Z_ARIBA_BAPI_PO_CHANGE>
         <urn1:Z_ARIBA_BAPI_PO_CHANGE>
            <!--You may enter the following 12 items in any order-->
            <!--Optional:-->
            <urn1:PARTITION>?</urn1:PARTITION>
            <urn1:PO_HEADER>
               <urn1:EBELN>?</urn1:EBELN>
               <urn1:ERPORDERID>?</urn1:ERPORDERID>
               <urn1:VERSION>?</urn1:VERSION>
               <urn1:LIFNR>?</urn1:LIFNR>
               <urn1:ORDERTYPE>?</urn1:ORDERTYPE>
               <urn1:EKGRP>?</urn1:EKGRP>
               <urn1:EKORG>?</urn1:EKORG>
               <urn1:AEDAT>?</urn1:AEDAT>
               <urn1:UNSEZ>?</urn1:UNSEZ>
               <urn1:WAERS>?</urn1:WAERS>
               <urn1:CHGSTATE>?</urn1:CHGSTATE>
               <!--Optional:-->
               <urn1:PMNTTRMS>?</urn1:PMNTTRMS>
            </urn1:PO_HEADER>
            <!--Optional:-->
            <urn1:VARIANT>?</urn1:VARIANT>
            <!--Optional:-->
            <urn1:DELPO_ACCNTS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:SERIAL_NO>?</urn1:SERIAL_NO>
               </urn1:item>
            </urn1:DELPO_ACCNTS>
            <!--Optional:-->
            <urn1:DELPO_ITEMS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
               </urn1:item>
            </urn1:DELPO_ITEMS>
            <!--Optional:-->
            <urn1:ERROR_MSG_TABLE>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELN>?</urn1:EBELN>
                  <urn1:ERPORDERID>?</urn1:ERPORDERID>
                  <urn1:NUMINSET>?</urn1:NUMINSET>
                  <urn1:TYPE>?</urn1:TYPE>
                  <urn1:MSGID>?</urn1:MSGID>
                  <urn1:MSGNR>?</urn1:MSGNR>
                  <urn1:DYNAME>?</urn1:DYNAME>
                  <urn1:DYNUMB>?</urn1:DYNUMB>
                  <urn1:FLDNAME>?</urn1:FLDNAME>
                  <urn1:MESSAGE>?</urn1:MESSAGE>
                  <urn1:DATETIME2>?</urn1:DATETIME2>
                  <urn1:SYSID>?</urn1:SYSID>
                  <urn1:MANDT>?</urn1:MANDT>
               </urn1:item>
            </urn1:ERROR_MSG_TABLE>
            <!--Optional:-->
            <urn1:PO_ACCOUNTS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:SERIAL_NO>?</urn1:SERIAL_NO>
                  <urn1:MKNTM>?</urn1:MKNTM>
                  <urn1:SAKTO>?</urn1:SAKTO>
                  <urn1:KOSTL>?</urn1:KOSTL>
                  <urn1:AUFNR>?</urn1:AUFNR>
                  <urn1:ANLN1>?</urn1:ANLN1>
                  <urn1:ANLN2>?</urn1:ANLN2>
                  <urn1:PS_PSP_PNR>?</urn1:PS_PSP_PNR>
                  <urn1:MKNTMLIMIT>?</urn1:MKNTMLIMIT>
                  <urn1:CHGSTATE>?</urn1:CHGSTATE>
               </urn1:item>
            </urn1:PO_ACCOUNTS>
            <!--Optional:-->
            <urn1:PO_COND>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:KSCHL>?</urn1:KSCHL>
                  <urn1:KBETR>?</urn1:KBETR>
                  <urn1:KONWA>?</urn1:KONWA>
               </urn1:item>
            </urn1:PO_COND>
            <!--Optional:-->
            <urn1:PO_ITEMS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:TXZ01>?</urn1:TXZ01>
                  <urn1:MATKL>?</urn1:MATKL>
                  <urn1:KNTTP>?</urn1:KNTTP>
                  <urn1:WERKS>?</urn1:WERKS>
                  <urn1:NETPR>?</urn1:NETPR>
                  <urn1:PEINH>?</urn1:PEINH>
                  <urn1:MENGE>?</urn1:MENGE>
                  <urn1:MEINS>?</urn1:MEINS>
                  <urn1:EEIND>?</urn1:EEIND>
                  <urn1:EMATNR>?</urn1:EMATNR>
                  <urn1:SAKTO>?</urn1:SAKTO>
                  <urn1:KOSTL>?</urn1:KOSTL>
                  <urn1:AUFNR>?</urn1:AUFNR>
                  <urn1:PS_PSP_PNR>?</urn1:PS_PSP_PNR>
                  <urn1:ANLN1>?</urn1:ANLN1>
                  <urn1:ANLN2>?</urn1:ANLN2>
                  <urn1:MWSKZ>?</urn1:MWSKZ>
                  <urn1:EPSTP>?</urn1:EPSTP>
                  <urn1:SUMLIMIT>?</urn1:SUMLIMIT>
                  <urn1:COMMITMENT>?</urn1:COMMITMENT>
                  <urn1:REQ_ID>?</urn1:REQ_ID>
                  <urn1:ITEMONREQ>?</urn1:ITEMONREQ>
                  <urn1:VRTKZ>?</urn1:VRTKZ>
                  <urn1:TWRKZ>?</urn1:TWRKZ>
                  <urn1:UNTTO>?</urn1:UNTTO>
                  <urn1:UEBTO>?</urn1:UEBTO>
                  <urn1:CHGSTATE>?</urn1:CHGSTATE>
                  <urn1:LGORT>?</urn1:LGORT>
               </urn1:item>
            </urn1:PO_ITEMS>
            <!--Optional:-->
            <urn1:PO_TEXT>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:TDOBJECT>?</urn1:TDOBJECT>
                  <urn1:TDID>?</urn1:TDID>
                  <urn1:STRINGNUM>?</urn1:STRINGNUM>
                  <urn1:STRING>?</urn1:STRING>
               </urn1:item>
            </urn1:PO_TEXT>
            <!--Optional:-->
            <urn1:PUR_ORDER_DELIVERY>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELN>?</urn1:EBELN>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:EINDT>?</urn1:EINDT>
               </urn1:item>
            </urn1:PUR_ORDER_DELIVERY>
            <!--Optional:-->
            <urn1:PUR_ORDER_DETAILS>
               <!--Zero or more repetitions:-->
               <urn1:item>
                  <urn1:EBELN>?</urn1:EBELN>
                  <urn1:EBELP>?</urn1:EBELP>
                  <urn1:AEDAT>?</urn1:AEDAT>
                  <urn1:MENGE>?</urn1:MENGE>
                  <urn1:MEINS>?</urn1:MEINS>
                  <urn1:NETPR>?</urn1:NETPR>
                  <urn1:REQ_ID>?</urn1:REQ_ID>
                  <urn1:ITEMONREQ>?</urn1:ITEMONREQ>
               </urn1:item>
            </urn1:PUR_ORDER_DETAILS>
         </urn1:Z_ARIBA_BAPI_PO_CHANGE>
      </urn1:Z_ARIBA_BAPI_PO_CHANGE>
   </soapenv:Body>
</soapenv:Envelope>